[
    {
        "title":"Intimidation among key takeaways from the Trump impeachment hearing with Marie Yovanovitch",
        "author":"Ledyard King",
        "date":"November 15, 2019",
        "img":"https://static.politico.com/dims4/default/be7910c/2147483647/resize/1160x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F12%2Fa0%2Feba7679548798e6f9f30ad20eee6%2F191114-donald-trump2-ap-773.jpg",
        "content":"WASHINGTON – Marie Yovanovitch told lawmakers she had only U.S. interests in mind while serving as ambassador to Ukraine at an impeachment inquiry hearing Friday during which President Donald Trump tweeted insults at her. Yovanovitch, 61, also responded to debunked GOP claims that Ukraine meddled in the 2016 U.S. elections, and agreed that the military aid the Trump administration endorsed – and is now at the heart of the investigation – has benefited the Eastern European country in its war against Russia.",
        "url":"https://www.usatoday.com/story/news/politics/2019/11/15/key-takeaways-trump-impeachment-hearing-marie-yovanovitch/4197205002/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatodaycomwashington-topstories",
        "source": "USA Today",
        "bias": -1
    },
    {
        "title":"A day that underscored the corruption swamping the Trump presidency",
        "author":"Stephen Collinson",
        "date":"November 16, 2019",
        "img":"https://ichef.bbci.co.uk/news/624/cpsprodpb/A917/production/_108978234_hi056797616.jpg",
        "content":"(CNN)A fateful convergence of events Friday reflected a culture of corruption and intimidation endemic to the circle of a President who vowed to drain the swamp but instead became its incarnation. First, a US ambassador told how her reputation was shredded and she was hounded out of her job by President Donald Trump's rogue associates after a faultless 30-year career advancing America's interests.",
        "url":"https://www.cnn.com/2019/11/16/politics/donald-trump-roger-stone-maria-yovanovitch-impeachment/index.html",
        "source": "CNN",
        "bias": -1
    }
]